signgate projesi submodule olarak eklendi taslak dokümantasyon oluşturuldu
